# Width Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..Width Property
EnergyAnalysisSurface Class See Also
---
The width of the analytical rectangular geometry.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Width { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Width As Double
	Get
```

Visual C++
---
```text
public:
property double Width {
	double get ();
}
```

# Remarks
The product of width and height should be equal to the area of the polyloop for the opening. The width is adjusted to accomplish this.
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace